#+TITLE: Sandbox Infra Tf
The Goal is to template building of all infra in the k8s-infra-ii-sandbox project.
Starting point would be to create a list of infra we need in the project.
The pr that kicked this off is [infra-adit#2011](https://github.com/kubernetes/k8s.io/pull/2011)
It mentions a bunch of one off infra that will be the focus of our doc.
* GCP things
First time using gcloud on this host, log in first.
#+begin_src shell
gcloud auth login
#+end_src
#+begin_src shell
gcloud auth list
#+end_src

#+RESULTS:
#+begin_example
         Credentialed Accounts
ACTIVE             ACCOUNT
,*                  bb@ii.coop
#+end_example

#+begin_src shell
gcloud projects list
#+end_src

#+RESULTS:
#+begin_example
PROJECT_ID                      NAME                            PROJECT_NUMBER
apisnoop                        apisnoop                        840466421052
k8s-artifacts-prod              k8s-artifacts-prod              388270116193
k8s-artifacts-prod-bak          k8s-artifacts-prod-bak          1057569514213
k8s-cip-test-prod               k8s-cip-test-prod               693665670941
k8s-conform                     k8s-conform                     228988630781
etc.......
#+end_example
Ok gcloud is active on my box
